---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailArc
source: html/12f4d91a-7b72-d610-e0bf-276e8fe43e93.htm
---
# DetailArc Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.